app/views/tasks/new.html.erb

          <%= form.label :user_id, "Assign to" %>
          <%= form.collection_select :user_id, User.all, :id, :email, prompt: "Select a user" %>
---
SELECT "users".* FROM "users"