app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.user = current_user

    if @task.save
---
INSERT INTO "tasks" ("title", "description", "status", "due_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"